In [6]:
import numpy as np
import pandas as pd

## Seriesを作成する

In [4]:
# dictionaryから作成
data = {
    '名前': 'ルフィ',
    '性別': '男', 
    '年齢': '１９', 
}

In [5]:
pd.Series(data)

名前    ルフィ
性別      男
年齢     １９
dtype: object

In [11]:
# numpy arrayから作成
array = np.array([1991, 2001, 2011, 2021])
year_series = pd.Series(array)
year_series

0    1991
1    2001
2    2011
3    2021
dtype: int64

In [ ]:
# Seriesから値を取ってくる
year_series.values

In [15]:
year_series.mean()

2006.0

In [9]:
array = np.array(['ルフィ', '男', 19])
luffy_series = pd.Series(array, index=['名前', '性別', '年齢'])
luffy_series

名前    ルフィ
性別      男
年齢     19
dtype: object

In [10]:
luffy_series['名前']

'ルフィ'

## DataFrameを作成する

### pd.DataFrame()

In [16]:
# numpy arrayから作成
ndarray = np.arange(10).reshape(2, 5)
ndarray

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

In [19]:
pd.DataFrame(ndarray, index=['index1', 'index2'], columns=['a', 'b', 'c', 'd', 'e'])

        a  b  c  d  e
index1  0  1  2  3  4
index2  5  6  7  8  9

In [22]:
# dictionaryから作成
data1 = {
    '名前': 'ルフィ',
    '性別': '男',
    '年齢': '１９', 
}
data2 = {
    '名前': 'ゾロ',
    '性別': '男',
    '年齢': '２１', 
}
data3 = {
    '名前': 'ナミ',
    '性別': '女',
    '年齢': '２０', 
}
pd.DataFrame([data1, data2, data3])

    名前 性別  年齢
0  ルフィ  男  １９
1   ゾロ  男  ２１
2   ナミ  女  ２０

In [68]:
data = {
    '名前': ['ルフィ', 'ゾロ', 'ナミ'],
    '性別': ['男', '男', '女'],
    '年齢': ['１９', '２１', '２０'],
}
df_pirate = pd.DataFrame(data)
df_pirate

    名前 性別  年齢
0  ルフィ  男  １９
1   ゾロ  男  ２１
2   ナミ  女  ２０

## pd.read_   ('Path')

In [31]:
df = pd.read_csv('./dataset/tmdb/tmdb_5000_movies.csv')
df.head()

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800
1,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.082615,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2007-05-19,961000000,169.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500
2,245000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{""id"": 470, ""name"": ""spy""}, {""id"": 818, ""name...",en,Spectre,A cryptic message from Bond’s past sends him o...,107.376788,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...","[{""iso_3166_1"": ""GB"", ""name"": ""United Kingdom""...",2015-10-26,880674609,148.0,"[{""iso_639_1"": ""fr"", ""name"": ""Fran\u00e7ais""},...",Released,A Plan No One Escapes,Spectre,6.3,4466
3,250000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 80, ""nam...",http://www.thedarkknightrises.com/,49026,"[{""id"": 849, ""name"": ""dc comics""}, {""id"": 853,...",en,The Dark Knight Rises,Following the death of District Attorney Harve...,112.312950,"[{""name"": ""Legendary Pictures"", ""id"": 923}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2012-07-16,1084939099,165.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,The Legend Ends,The Dark Knight Rises,7.6,9106
4,260000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://movies.disney.com/john-carter,49529,"[{""id"": 818, ""name"": ""based on novel""}, {""id"":...",en,John Carter,"John Carter is a war-weary, former military ca...",43.926995,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}]","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2012-03-07,284139100,132.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"Lost in our world, found in another.",John Carter,6.1,2124

## DataFrame基本操作

### データ確認

In [37]:
len(df)

4803

In [41]:
df.columns

Index(['budget', 'genres', 'homepage', 'id', 'keywords', 'original_language',
       'original_title', 'overview', 'popularity', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'vote_average',
       'vote_count'],
      dtype='object')

In [39]:
df.describe() # type=DataFrame

,budget,id,popularity,revenue,runtime,vote_average,vote_count
count,4.803000e+03,4803.000000,4803.000000,4.803000e+03,4801.000000,4803.000000,4803.000000
mean,2.904504e+07,57165.484281,21.492301,8.226064e+07,106.875859,6.092172,690.217989
std,4.072239e+07,88694.614033,31.816650,1.628571e+08,22.611935,1.194612,1234.585891
min,0.000000e+00,5.000000,0.000000,0.000000e+00,0.000000,0.000000,0.000000
25%,7.900000e+05,9014.500000,4.668070,0.000000e+00,94.000000,5.600000,54.000000
50%,1.500000e+07,14629.000000,12.921594,1.917000e+07,103.000000,6.200000,235.000000
75%,4.000000e+07,58610.500000,28.313505,9.291719e+07,118.000000,6.800000,737.000000
max,3.800000e+08,459488.000000,875.581305,2.787965e+09,338.000000,10.000000,13752.000000

In [46]:
df['revenue'].head() # type=Series

0    2787965087
1     961000000
2     880674609
3    1084939099
4     284139100
Name: revenue, dtype: int64

In [47]:
df[['vote_average', 'vote_count']].head()

   vote_average  vote_count
0           7.2       11800
1           6.9        4500
2           6.3        4466
3           7.6        9106
4           6.1        2124

### .iloc .loc

In [48]:
df.iloc[10] # indexを指定

budget                                                          270000000
genres                  [{"id": 12, "name": "Adventure"}, {"id": 14, "...
homepage                                          http://www.superman.com
id                                                                   1452
keywords                [{"id": 83, "name": "saving the world"}, {"id"...
original_language                                                      en
original_title                                           Superman Returns
overview                Superman returns to discover his 5-year absenc...
popularity                                                        57.9256
production_companies    [{"name": "DC Comics", "id": 429}, {"name": "L...
production_countries    [{"iso_3166_1": "US", "name": "United States o...
release_date                                                   2006-06-28
revenue                                                         391081192
runtime                                                               154
spoken_languages        [{"iso_639_1": "en", "name": "English"}, {"iso...
status                                                           Released
tagline                                                               NaN
title                                                    Superman Returns
vote_average                                                          5.4
vote_count                                                           1400
Name: 10, dtype: object

In [50]:
df.iloc[10:13]['budget']

10    270000000
11    200000000
12    200000000
Name: budget, dtype: int64

In [59]:
df.loc[10]

budget                                                          270000000
genres                  [{"id": 12, "name": "Adventure"}, {"id": 14, "...
homepage                                          http://www.superman.com
id                                                                   1452
keywords                [{"id": 83, "name": "saving the world"}, {"id"...
original_language                                                      en
original_title                                           Superman Returns
overview                Superman returns to discover his 5-year absenc...
popularity                                                        57.9256
production_companies    [{"name": "DC Comics", "id": 429}, {"name": "L...
production_countries    [{"iso_3166_1": "US", "name": "United States o...
release_date                                                   2006-06-28
revenue                                                         391081192
runtime                                                               154
spoken_languages        [{"iso_639_1": "en", "name": "English"}, {"iso...
status                                                           Released
tagline                                                               NaN
title                                                    Superman Returns
vote_average                                                          5.4
vote_count                                                           1400
Name: 10, dtype: object

In [51]:
# カラムが数字、indexが文字列の場合(あんまない)
ndarray = np.arange(25).reshape(5, 5)
index = ['a', 'b', 'c', 'd', 'e']
columes = [0, 1, 2, 3, 4]
df1 = pd.DataFrame(ndarray, index=index, columns=columes)
df1

    0   1   2   3   4
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [56]:
print(df1[0])
print('#'*30)
print(df1.loc['a'])

a     0
b     5
c    10
d    15
e    20
Name: 0, dtype: int64
##############################
0    0
1    1
2    2
3    3
4    4
Name: a, dtype: int64

In [60]:
series = pd.Series([100, 100, 100, 100, 100], index=['a', 'b', 'c', 'd', 'e'])
df1[0] = series
df1

     0   1   2   3   4
a  100   1   2   3   4
b  100   6   7   8   9
c  100  11  12  13  14
d  100  16  17  18  19
e  100  21  22  23  24

In [61]:
df1[5] = series
df1

     0   1   2   3   4    5
a  100   1   2   3   4  100
b  100   6   7   8   9  100
c  100  11  12  13  14  100
d  100  16  17  18  19  100
e  100  21  22  23  24  100

### .drop()

In [62]:
df1.drop('a') # index

     0   1   2   3   4    5
b  100   6   7   8   9  100
c  100  11  12  13  14  100
d  100  16  17  18  19  100
e  100  21  22  23  24  100

In [66]:
df1.drop(0, axis=1, inplace=False) # colume　　　元のdfを変更する場合は,inplace=True

    1   2   3   4    5
a   1   2   3   4  100
b   6   7   8   9  100
c  11  12  13  14  100
d  16  17  18  19  100
e  21  22  23  24  100

In [67]:
df1

     0   1   2   3   4    5
a  100   1   2   3   4  100
b  100   6   7   8   9  100
c  100  11  12  13  14  100
d  100  16  17  18  19  100
e  100  21  22  23  24  100

## フィルター

In [87]:
data = {
    '名前': ['ルフィ', 'ゾロ', 'ナミ', 'ウソップ', 'サンジ', 'チョッパー', 'ロビン', 'フランキー', 'ブルック', 'ジンベエ'],
    '性別': ['男', '男', '女', '男', '男', '男', '女', '男', '男', '男'],
    '年齢': ['１９', '２１', '２０', '１９', '２１', '１７', '３０', '３６', '９０', '４６'],
}
df_pirate = pd.DataFrame(data)
df_pirate

      名前 性別  年齢
0    ルフィ  男  １９
1     ゾロ  男  ２１
2     ナミ  女  ２０
3   ウソップ  男  １９
4    サンジ  男  ２１
5  チョッパー  男  １７
6    ロビン  女  ３０
7  フランキー  男  ３６
8   ブルック  男  ９０
9   ジンベエ  男  ４６

In [76]:
data = {
    '名前': ['ルフィ', 'ゾロ', 'ナミ'],
    '性別': ['男', '男', '女'],
    '年齢': ['１９', '２１', '２０'],
}
df_pirate = pd.DataFrame(data)
df_pirate

    名前 性別  年齢
0  ルフィ  男  １９
1   ゾロ  男  ２１
2   ナミ  女  ２０

In [92]:
f = np.array([0, 1, 1, 0, 0, 1, 0, 1, 0, 1])
df_pirate[[f]]

KeyError: "None of [Index([(0, 1, 1, 0, 0, 1, 0, 1, 0, 1)], dtype='object')] are in the [columns]"